Table of Contents
 Class IdeaLoadCase
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaLoadCase : AbstractIdeaObject<IIdeaLoadCase>, IEquatable<AbstractIdeaObject<IIdeaLoadCase>>, IIdeaLoadCase, IIdeaLoading, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaLoadCase>
IdeaLoadCase
Implements
IEquatable<AbstractIdeaObject<IIdeaLoadCase>>
IIdeaLoadCase
IIdeaLoading
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaLoadCase>.Id
 AbstractIdeaObject<IIdeaLoadCase>.Name
 AbstractIdeaObject<IIdeaLoadCase>.Identifier
 AbstractIdeaObject<IIdeaLoadCase>.GetHashCode()
 AbstractIdeaObject<IIdeaLoadCase>.Equals(object)
 AbstractIdeaObject<IIdeaLoadCase>.Equals(AbstractIdeaObject<IIdeaLoadCase>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaLoadCase(Identifier<IIdeaLoadCase>)
public IdeaLoadCase(Identifier<IIdeaLoadCase> identifer)
Parameters
identifer Identifier<IIdeaLoadCase>
 IdeaLoadCase(int)
public IdeaLoadCase(int id)
Parameters
id int
 IdeaLoadCase(string)
public IdeaLoadCase(string id)
Parameters
id string
Properties
 Description
Additional info
public virtual string Description { get; set; }
Property Value
string
 LoadGroup
Load group
public virtual IIdeaLoadGroup LoadGroup { get; set; }
Property Value
IIdeaLoadGroup
 LoadType
Load case type
public virtual LoadCaseType LoadType { get; set; }
Property Value
LoadCaseType
 Type
Sub type
public virtual LoadCaseSubType Type { get; set; }
Property Value
LoadCaseSubType
 Variable
Variable type
public virtual VariableType Variable { get; set; }
Property Value
VariableType
 Edit this page